#include "CallBackIntStates.h"
#include "stdafx.h"

#include "skin_changer.hpp"
#include "skin_database.hpp"

#include "json.hpp"
#include "LeagueHooks.h"
#include "Orbwalker.h"
#include "Globals.h"
#include "StaticLists.h"

#include "Misc.h"
#include "Callbacks.h"
#include "HeavensGateHook.h"
#include "LUA.h"
#include "TargetSelector.h"
#include "LeagueFunctions.h"


CObjectManager* ObjManager;
CFunctions Functions;
ExampleAppLog AppLog;

struct ActiveSpellInfo {
	int SpellSlot;				// 0x4
	float StartTime;			// 0x8				gametime of when the missile is started.
	int SpellIndex;				// 0xC				this is a index of spells casted
	Vector StartPos;			// 0x78
	Vector EndPos;				// 0x84
	Vector CastPos;				// 0x90
	float winduptime;			// 0x4B8
	float CoolDown;				// 0x4CC
	float ManaCost;				// 0x4E0
	float EndTime;				// 0x7D0			this ends WAY after spell missile has already been destroyed... 

	int CasterIndex;			// part of a different struct but we're adding it in anyways so we can access this info...
};

std::map<int, struct ActiveSpellInfo> ActiveSpellMap;
std::map<int, struct CObject*> ActiveMissiles;
SpellCastInfo* ActiveSpell = nullptr;
extern DWORD __NewIssueOrderCheck;

namespace DX11
{
	using json = nlohmann::json;

	int32_t config::current_combo_skin_index = 0;
	int32_t config::current_combo_ward_index = 0;
	int32_t config::current_combo_minion_index = 0;

	int32_t config::current_ward_skin_index = -1;
	int32_t config::current_minion_skin_index = -1;

	std::map<uint32_t, int32_t> config::current_combo_jungle_mob_skin_index;

	std::map<uint32_t, int32_t> config::current_combo_ally_skin_index;
	std::map<uint32_t, int32_t> config::current_combo_enemy_skin_index;

	auto config_json = json();

	void config::save()
	{
		auto player = me;
		if (player)
